/*
    LOLIcon, reF00D, rePatch, ioPlus by dots-tb
    NoAvls by SilicaAndPina
    NoNpDrm by TheFlow
    Gamecard-MicroSD by xyzz
    \/          \/
    Combo by SKGleba
*/

#include <taihen.h>
#include <string.h>
#include <sys/syslimits.h>
#include <stdio.h>
#include "blit.h"
#include "utils.h"


#include <psp2kern/kernel/utils.h>
#include <vitasdkkern.h>

#include <taihen.h>

#include <stdarg.h>

#define LEFT_LABEL_X CENTER(24)
#define RIGHT_LABEL_X CENTER(0)
#define printf ksceDebugPrintf
#define HOOKS_NUMBER 7
#define HOOKS_NUMBER_RF 5

#define DEVICES_AMT_RF 4

#include "repatch.h"
#include "self.h"
#include "elf.h"

static int hooks_uid[HOOKS_NUMBER];
static tai_hook_ref_t ref_hooks[HOOKS_NUMBER];

static int hook = -1;
static tai_hook_ref_t ref_hook;

static int hook_iop = -1;
static tai_hook_ref_t ref_hook_iop;

#define MOUNT_POINT_ID 0x800
#define MOUNT_POINT_ID2 0xF00

int module_get_offset(SceUID pid, SceUID modid, int segidx, size_t offset, uintptr_t *addr);

typedef struct {
	const char *dev;
	const char *dev2;
	const char *blkdev;
	const char *blkdev2;
	int id;
} SceIoDevice;

typedef struct {
	int id;
	const char *dev_unix;
	int unk;
	int dev_major;
	int dev_minor;
	const char *dev_filesystem;
	int unk2;
	SceIoDevice *dev;
	int unk3;
	SceIoDevice *dev2;
	int unk4;
	int unk5;
	int unk6;
	int unk7;
} SceIoMountPoint;

typedef struct {
    char magic[7];
    char slots[7];
} __attribute__((packed)) devsett;

static SceIoDevice uma_ux0_dev = { "ux0:", "exfatux0", "sdstor0:gcd-lp-ign-entire", "sdstor0:gcd-lp-ign-entire", MOUNT_POINT_ID };
static SceIoDevice uma_uma0_dev = { "uma0:", "exfatuma0", "sdstor0:xmc-lp-ign-userext", "sdstor0:xmc-lp-ign-userext", MOUNT_POINT_ID2 };

static SceIoMountPoint *(* sceIoFindMountPoint)(int id) = NULL;

static SceIoDevice *ori_dev = NULL, *ori_dev2 = NULL;

static void io_remount(int id) {
	ksceIoUmount(id, 0, 0, 0);
	ksceIoUmount(id, 1, 0, 0);
	ksceIoMount(id, NULL, 0, 0, 0, 0);
}

static void io_mount(int id) {
	ksceIoMount(id, NULL, 0, 0, 0, 0);
}

int shellKernelRedirectUx0() {
	SceIoMountPoint *mount = sceIoFindMountPoint(MOUNT_POINT_ID);
	if (!mount) {
		return -1;
	}

	if (mount->dev != &uma_ux0_dev && mount->dev2 != &uma_ux0_dev) {
		ori_dev = mount->dev;
		ori_dev2 = mount->dev2;
	}

	mount->dev = &uma_ux0_dev;
	mount->dev2 = &uma_ux0_dev;

	return 0;
}

int shellKernelRedirectUma0() {
	SceIoMountPoint *mount = sceIoFindMountPoint(MOUNT_POINT_ID2);
	if (!mount) {
		return -1;
	}

	if (mount->dev != &uma_uma0_dev && mount->dev2 != &uma_uma0_dev) {
		ori_dev = mount->dev;
		ori_dev2 = mount->dev2;
	}

	mount->dev = &uma_uma0_dev;
	mount->dev2 = &uma_uma0_dev;

	return 0;
}

// ux0 redirect by theflow
int redirect_ux0() {
	// Get tai module info
	tai_module_info_t info;
	info.size = sizeof(tai_module_info_t);
	if (taiGetModuleInfoForKernel(KERNEL_PID, "SceIofilemgr", &info) < 0)
		return -1;

	// Get important function
	switch (info.module_nid) {
		case 0x9642948C: // 3.60 retail
			module_get_offset(KERNEL_PID, info.modid, 0, 0x138C1, (uintptr_t *)&sceIoFindMountPoint);
			break;

		case 0xA96ACE9D: // 3.65 retail
		case 0x3347A95F: // 3.67 retail
		case 0x90DA33DE: // 3.68 retail
			module_get_offset(KERNEL_PID, info.modid, 0, 0x182F5, (uintptr_t *)&sceIoFindMountPoint);
			break;

		default:
			return -1;
	}

	shellKernelRedirectUx0();
	io_remount(MOUNT_POINT_ID);
	shellKernelRedirectUma0();
    io_mount(MOUNT_POINT_ID2);

	return 0;
}

int poke_gamecard() {
	tai_module_info_t info;
	info.size = sizeof(tai_module_info_t);
	if (taiGetModuleInfoForKernel(KERNEL_PID, "SceSdstor", &info) < 0)
		return -1;

	void *args = 0;
	int (*int_insert)() = 0;
	int (*int_remove)() = 0;

	module_get_offset(KERNEL_PID, info.modid, 0, 0x3BD5, (uintptr_t *)&int_insert);
	module_get_offset(KERNEL_PID, info.modid, 0, 0x3BC9, (uintptr_t *)&int_remove);

	module_get_offset(KERNEL_PID, info.modid, 1, 0x1B20 + 40 * 1, (uintptr_t *)&args);

	int_remove(0, args);
	ksceKernelDelayThread(500 * 1000);
	int_insert(0, args);
	ksceKernelDelayThread(500 * 1000);

	return 0;
}

tai_hook_ref_t hook_get_partition;
tai_hook_ref_t hook_write;
tai_hook_ref_t hook_mediaid;

uint32_t magic = 0x7FFFFFFF;

void *sdstor_mediaid;

void *my_get_partition(const char *name, size_t len) {
	void *ret = TAI_CONTINUE(void*, hook_get_partition, name, len);
	if (!ret && len == 18 && strcmp(name, "gcd-lp-act-mediaid") == 0) {
		return &magic;
	}
	return ret;
}

uint32_t my_write(uint8_t *dev, void *buf, uint32_t sector, uint32_t size) {
	if (dev[36] == 1 && sector == magic) {
		return 0;
	}
	return TAI_CONTINUE(uint32_t, hook_write, dev, buf, sector, size);
}

uint32_t my_mediaid(uint8_t *dev) {
	uint32_t ret = TAI_CONTINUE(uint32_t, hook_mediaid, dev);

	if (dev[36] == 1) {
		memset(dev + 20, 0xFF, 16);
		memset(sdstor_mediaid, 0xFF, 16);

		return magic;
	}
	return ret;
}

// allow SD cards, patch by motoharu
void patch_sdstor() {
	tai_module_info_t sdstor_info;
	sdstor_info.size = sizeof(tai_module_info_t);
	if (taiGetModuleInfoForKernel(KERNEL_PID, "SceSdstor", &sdstor_info) < 0)
		return;

	module_get_offset(KERNEL_PID, sdstor_info.modid, 1, 0x1720, (uintptr_t *) &sdstor_mediaid);

	// patch for proc_initialize_generic_2 - so that sd card type is not ignored
	char zeroCallOnePatch[4] = {0x01, 0x20, 0x00, 0xBF};
	taiInjectDataForKernel(KERNEL_PID, sdstor_info.modid, 0, 0x2498, zeroCallOnePatch, 4); //patch (BLX) to (MOVS R0, #1 ; NOP)
	taiInjectDataForKernel(KERNEL_PID, sdstor_info.modid, 0, 0x2940, zeroCallOnePatch, 4);

	taiHookFunctionOffsetForKernel(KERNEL_PID, &hook_get_partition, sdstor_info.modid, 0, 0x142C, 1, my_get_partition);
	taiHookFunctionOffsetForKernel(KERNEL_PID, &hook_write, sdstor_info.modid, 0, 0x2C58, 1, my_write);
	taiHookFunctionOffsetForKernel(KERNEL_PID, &hook_mediaid, sdstor_info.modid, 0, 0x3D54, 1, my_mediaid);
}

// allow Memory Card remount
void patch_appmgr() {
	tai_module_info_t appmgr_info;
	appmgr_info.size = sizeof(tai_module_info_t);
	if (taiGetModuleInfoForKernel(KERNEL_PID, "SceAppMgr", &appmgr_info) >= 0) {
		uint32_t nop_nop_opcode = 0xBF00BF00;
		switch (appmgr_info.module_nid) {
			case 0xDBB29DB7: // 3.60 retail
			case 0x1C9879D6: // 3.65 retail
				taiInjectDataForKernel(KERNEL_PID, appmgr_info.modid, 0, 0xB338, &nop_nop_opcode, 4);
				taiInjectDataForKernel(KERNEL_PID, appmgr_info.modid, 0, 0xB368, &nop_nop_opcode, 2);
				break;

			case 0x54E2E984: // 3.67 retail
			case 0xC3C538DE: // 3.68 retail
				taiInjectDataForKernel(KERNEL_PID, appmgr_info.modid, 0, 0xB344, &nop_nop_opcode, 4);
				taiInjectDataForKernel(KERNEL_PID, appmgr_info.modid, 0, 0xB374, &nop_nop_opcode, 2);
				break;
		}
	}
}

static int sceFiosKernelOverlayResolveSyncForDriver_patched(SceUID pid, int resolveFlag, const char *pInPath, char *pOutPath, size_t maxPath) {
	int ret, state;
	ENTER_SYSCALL(state);
	ret = TAI_CONTINUE(int, ref_hook_iop, pid, resolveFlag, pInPath, pOutPath, maxPath);
	if(memcmp("invalid", pOutPath, sizeof("invalid") - 1) == 0)
		strncpy(pOutPath, pInPath, maxPath);
	EXIT_SYSCALL(state);
	return ret;
} 

//r1 unk pointer
//r2 unk pointer
//r3 - pointer to int (avls)
static int sceAVConfigGetVolCtrlEnable_patched(int r1, int r2, int r3, int r4) {
	int ret, state;
	ENTER_SYSCALL(state);
	ret = TAI_CONTINUE(int, ref_hook,r1,r2,r3,r4);
	uint32_t avls = 0;
	ksceKernelMemcpyKernelToUser((uintptr_t)r3, &avls, sizeof(avls));
	EXIT_SYSCALL(state);
	return ret;
}	

#define FAKE_AID 0x0123456789ABCDEFLL

static tai_hook_ref_t ksceKernelLaunchAppRef;
static tai_hook_ref_t ksceNpDrmGetRifInfoRef;
static tai_hook_ref_t ksceNpDrmGetRifVitaKeyRef;
static tai_hook_ref_t ksceNpDrmGetRifNameRef;
static tai_hook_ref_t ksceNpDrmGetRifNameForInstallRef;

static SceUID hooks[5];
static int n_hooks = 0;

typedef struct {
  uint16_t version;                 // 0x00
  uint16_t version_flag;            // 0x02
  uint16_t type;                    // 0x04
  uint16_t flags;                   // 0x06
  uint64_t aid;                     // 0x08
  char content_id[0x30];            // 0x10
  uint8_t key_table[0x10];          // 0x40
  uint8_t key[0x10];                // 0x50
  uint64_t start_time;              // 0x60
  uint64_t expiration_time;         // 0x68
  uint8_t ecdsa_signature[0x28];    // 0x70

  uint64_t flags2;                  // 0x98
  uint8_t key2[0x10];               // 0xA0
  uint8_t unk_B0[0x10];             // 0xB0
  uint8_t openpsid[0x10];           // 0xC0
  uint8_t unk_D0[0x10];             // 0xD0
  uint8_t cmd56_handshake[0x14];    // 0xE0
  uint32_t unk_F4;                  // 0xF4
  uint32_t unk_F8;                  // 0xF8
  uint32_t sku_flag;                // 0xFC
  uint8_t rsa_signature[0x100];     // 0x100
} SceNpDrmLicense;

int ksceNpDrmGetFixedRifName(char *rif_name, uint32_t flags, uint64_t is_gc);
int ksceNpDrmGetRifVitaKey(SceNpDrmLicense *license_buf, uint8_t *klicensee, uint32_t *flags,
                           uint32_t *sku_flag, uint64_t *start_time, uint64_t *expiration_time);

static int MakeFakeLicense(char *license_path, SceNpDrmLicense *license_buf) {
  int res;
  char path[512];
  char rif_name[48];
  uint8_t klicensee[0x10];

  // Get klicensee
  memset(klicensee, 0, sizeof(klicensee));
  res = ksceNpDrmGetRifVitaKey(license_buf, klicensee, NULL, NULL, NULL, NULL);
  if (res < 0)
    return res;

  // Check validity of klicensee
  int count = 0;

  int i;
  for (i = 0; i < sizeof(klicensee); i++) {
    if (klicensee[i] == 0)
      count++;
  }

  if (count == sizeof(klicensee))
    return -1;

  // Get fixed rif name
  res = ksceNpDrmGetFixedRifName(rif_name, 0, 0LL);
  if (res < 0)
    return res;

  // Make path
